Tekla Open API Reference for Tekla Structures 2025
RebarThreadingDataNullable.ThreadingType Property
 Gets or sets the threading type. Null indicates that the threading type is not specified.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ThreadingType { get; set; }
Public Property ThreadingType As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RebarThreadingDataNullable Class
Tekla.Structures.Model Namespace